---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewOuterShellMode
source: html/8aa76001-dcb1-14f7-0caa-7cedc9d11d77.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewOuterShellMode Property

"Show Analytical Space Shells"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewOuterShellMode { get; }
```